[
    {
        "name": "Chris Donnelly",
        "JobTitle": "Entrepreneur, Author, Speaker & Investor. Follow for posts on business & personal growth. Founder of The Creator Accelerator",
        "location": "London, England, United Kingdom",
        "about": "For commercial enquiries please message: enquiries@chris-donnelly.co.uk\n\nFor speaking enquiries please message: speaking@chris-donnelly.co.uk\n\nChris writes a newsletter called Step By Step \n\nStep By Step is a Newsletter with 400,000+ followers who receive \"Actionable business & personal advice from someone who has actually done it\". \n\nChris is the Co Founder of The Lottie Organisation (including Found CRM & Seniorcare)\n\nLottie is a health tech business that is designed to \"Elevate later life\".\n\nDescribed as the air b and b for care homes. Lottie supports individuals looking for the right care home and ensures that the family and the resident get the best care possible at the best price possible. \n\nFound CRM is the leading CRM & Occupancy software for care homes & retirement living communities\n\nSeniorcare offer the UK's leading eldercare employee benefit solution, and help your employees understand, find and fund care for their elderly loved ones.\n\nVerb Brands\n\nChris Donnelly is the founder of Verb Brands. \n\nVERB is a luxury digital marketing agency that drives strategy, growth, and revenue. The world’s only luxury data-driven, creative media agency, VERB provides full service performance marketing for luxury and premium brands. Based in London, Manchester, New York, and Shanghai. \n\nChris led the business as Founder & CEO from 2013 until 2021 until the business was acquired by Croud in an 8 figure private equity backed deal with the company being rebranded to Croud Luxe\nFor commercial enquiries please message: enquiries@chris-donnelly.co.uk For speaking enquiries please message: speaking@chris-donnelly.co.uk Chris writes a newsletter called Step By Step Step By Step is a Newsletter with 400,000+ followers who receive \"Actionable business & personal advice from someone who has actually done it\". Chris is the Co Founder of The Lottie Organisation (including Found CRM & Seniorcare) Lottie is a health tech business that is designed to \"Elevate later life\". Described as the air b and b for care homes. Lottie supports individuals looking for the right care home and ensures that the family and the resident get the best care possible at the best price possible. Found CRM is the leading CRM & Occupancy software for care homes & retirement living communities Seniorcare offer the UK's leading eldercare employee benefit solution, and help your employees understand, find and fund care for their elderly loved ones. Verb Brands Chris Donnelly is the founder of Verb Brands. VERB is a luxury digital marketing agency that drives strategy, growth, and revenue. The world’s only luxury data-driven, creative media agency, VERB provides full service performance marketing for luxury and premium brands. Based in London, Manchester, New York, and Shanghai. Chris led the business as Founder & CEO from 2013 until 2021 until the business was acquired by Croud in an 8 figure private equity backed deal with the company being rebranded to Croud Luxe"
    },
    {
        "name": "Josh S.",
        "JobTitle": "Co-Founder & Head of Content @ The Creator Accelerator. Click the link below👇",
        "location": "London, England, United Kingdom",
        "about": "Yo,\n\nAfter 3+ years within the personal branding space. I've helped build and scale personal brands of all sizes from varying industries.\n\nCurrently, I'm helping Chris Donnelly become the most recognised entrepreneur on the planet.\n\n6 months in we've:\n\n- Grown on LinkedIn by 370,000 followers (180k - 550k)\n- Have achieved 150m+ views on LinkedIn \n- Grown on Tiktok by 250,000 (200k - 450k) \n- Grown on Instagram by 300,000 (0-300k)\n\nFor more resources on how to become the ultimate creator, check out my Stan Store: https://www.stan.store/joshejsanders?ref=joshejsanders&utm_source=linkedin.com&utm_medium=joshejsanders&utm_campaign=website_link\nYo, After 3+ years within the personal branding space. I've helped build and scale personal brands of all sizes from varying industries. Currently, I'm helping Chris Donnelly become the most recognised entrepreneur on the planet. 6 months in we've: - Grown on LinkedIn by 370,000 followers (180k - 550k) - Have achieved 150m+ views on LinkedIn - Grown on Tiktok by 250,000 (200k - 450k) - Grown on Instagram by 300,000 (0-300k) For more resources on how to become the ultimate creator, check out my Stan Store: https://www.stan.store/joshejsanders?ref=joshejsanders&utm_source=linkedin.com&utm_medium=joshejsanders&utm_campaign=website_link"
    },
    {
        "name": "Reno Perry",
        "JobTitle": "#1 in the world for Careers & Coaching on LinkedIn | Helping people land $200K-$500K roles they'll love | Follow for posts about the job search, career growth, personal branding, and AI tools",
        "location": "Greater Chicago Area",
        "about": "Hey there 👋 thanks for stopping by!\n\nHere are a few ways we can work together👇\n\n𝗛𝗶𝗿𝗶𝗻𝗴: My company Wiseful can help with our unique recruiting approach. Tell us who you need to hire and we tap experts in your field who recommend perfect matches for your open roles.\n\n𝗝𝗼𝗯 𝗦𝗲𝗮𝗿𝗰𝗵 𝗖𝗼𝗮𝗰𝗵𝗶𝗻𝗴: I offer coaching to a select group of professionals each month looking to land $200K-$500K roles they'll love. Clients have landed jobs at companies like Google, LinkedIn, Brex, 1Password, OpenAI, Apple, and others. \n\n𝗟𝗶𝗻𝗸𝗲𝗱𝗜𝗻 𝗚𝗿𝗼𝘄𝘁𝗵 & 𝗠𝗼𝗻𝗲𝘁𝗶𝘇𝗮𝘁𝗶𝗼𝗻: I'm sharing the system I used to go from 0 to 375,000+ followers organically, become one of the biggest thought leaders on the platform, and grow my business to $1,000,000 in ARR in 4 months using LinkedIn. Offering individual & group consultations on a limited basis.\n\n𝗕𝗿𝗮𝗻𝗱 𝗣𝗮𝗿𝘁𝗻𝗲𝗿𝘀𝗵𝗶𝗽𝘀: I do sponsored LinkedIn posts with select B2C & B2B brands each year that I think could provide a useful product or service to my audience.\n\nReach out to 𝐫𝐞𝐧𝐨@𝐰𝐢𝐬𝐞𝐟𝐮𝐥.𝐜𝐨 or send me an InMail with one of the above topics in the subject line (e.g. “Hiring”) if you want to learn more. \n\nMore about me:\n\n- Currently living in Chicago\n- LinkedIn Top Voice\n- #1 LinkedIn Creator in Careers & Coaching (Favikon, 2024)\n- Top 12 LinkedIn Creator Worldwide (Favikon, 2024)\n- Over 200,000,000 views of my content\n- Over $6,000,000 in earned media value\n- Featured in Fast Company, Forbes, Business Insider, etc.\n- Helped thousands land fulfilling, 6-figure jobs\n- Built a 7-figure business using LinkedIn\n\nI've also sold millions of dollars in SaaS products & services, advised executives from start-ups to large enterprises, led teams, and worked at some amazing companies like LinkedIn, Fortune 500 Stanley Black & Decker, and the #1 virtual-coaching platform, BetterUp.\n\nNow I’m on a mission to help others realize their potential and connect talent to opportunity.\nHey there 👋 thanks for stopping by! Here are a few ways we can work together👇 𝗛𝗶𝗿𝗶𝗻𝗴: My company Wiseful can help with our unique recruiting approach. Tell us who you need to hire and we tap experts in your field who recommend perfect matches for your open roles. 𝗝𝗼𝗯 𝗦𝗲𝗮𝗿𝗰𝗵 𝗖𝗼𝗮𝗰𝗵𝗶𝗻𝗴: I offer coaching to a select group of professionals each month looking to land $200K-$500K roles they'll love. Clients have landed jobs at companies like Google, LinkedIn, Brex, 1Password, OpenAI, Apple, and others. 𝗟𝗶𝗻𝗸𝗲𝗱𝗜𝗻 𝗚𝗿𝗼𝘄𝘁𝗵 & 𝗠𝗼𝗻𝗲𝘁𝗶𝘇𝗮𝘁𝗶𝗼𝗻: I'm sharing the system I used to go from 0 to 375,000+ followers organically, become one of the biggest thought leaders on the platform, and grow my business to $1,000,000 in ARR in 4 months using LinkedIn. Offering individual & group consultations on a limited basis. 𝗕𝗿𝗮𝗻𝗱 𝗣𝗮𝗿𝘁𝗻𝗲𝗿𝘀𝗵𝗶𝗽𝘀: I do sponsored LinkedIn posts with select B2C & B2B brands each year that I think could provide a useful product or service to my audience. Reach out to 𝐫𝐞𝐧𝐨@𝐰𝐢𝐬𝐞𝐟𝐮𝐥.𝐜𝐨 or send me an InMail with one of the above topics in the subject line (e.g. “Hiring”) if you want to learn more. More about me: - Currently living in Chicago - LinkedIn Top Voice - #1 LinkedIn Creator in Careers & Coaching (Favikon, 2024) - Top 12 LinkedIn Creator Worldwide (Favikon, 2024) - Over 200,000,000 views of my content - Over $6,000,000 in earned media value - Featured in Fast Company, Forbes, Business Insider, etc. - Helped thousands land fulfilling, 6-figure jobs - Built a 7-figure business using LinkedIn I've also sold millions of dollars in SaaS products & services, advised executives from start-ups to large enterprises, led teams, and worked at some amazing companies like LinkedIn, Fortune 500 Stanley Black & Decker, and the #1 virtual-coaching platform, BetterUp. Now I’m on a mission to help others realize their potential and connect talent to opportunity."
    },
    {
        "name": "Katie A.",
        "JobTitle": "Founder & CEO of P3PRMNT | Redefining Lifestyle, Community and Sustainability, One Sale at a Time 🌿🥤Raising SEIS",
        "location": "London, England, United Kingdom",
        "about": "Hey there! I’m Katie, a 22-year-old entrepreneur passionate about creating a meaningful impact through my lifestyle brand P3PRMNT\n\n💫 At 14, I launched my first business, selling thrifted clothing.\n💫 By 18, I opened my first online store and sold 60,000 units in just one year.\n💫 At 20, I decided to take things further, scaling that business into what is now @p3prmnt.\n\nToday, I’m pushing boundaries, reimagining how businesses operate and how we, as entrepreneurs, can shape a more conscious society.\n\nDriven by my commitment to sustainability, community, and connection, I’m paving the way for a new business model—one that puts people and the planet at the forefront.\n\n🚀 That’s why I founded P3PRMNT—a forward-thinking lifestyle brand designed to make a difference.\n\n✨ Our mission is to inspire people to live more freely, make conscious purchasing decisions, and feel connected to something bigger than themselves.\n\n🌱 We foster real-world connections through our \"IRL\" events.\n🌿 And, on the B2B side, we help businesses across the UK streamline their transition to eco-friendly practices.\n\nAnd... we’re on a mission to take P3PRMNT global✌️\n\nWant to know more or explore partnership opportunities?\nSend me a DM! 📧\nHey there! I’m Katie, a 22-year-old entrepreneur passionate about creating a meaningful impact through my lifestyle brand P3PRMNT 💫 At 14, I launched my first business, selling thrifted clothing. 💫 By 18, I opened my first online store and sold 60,000 units in just one year. 💫 At 20, I decided to take things further, scaling that business into what is now @p3prmnt. Today, I’m pushing boundaries, reimagining how businesses operate and how we, as entrepreneurs, can shape a more conscious society. Driven by my commitment to sustainability, community, and connection, I’m paving the way for a new business model—one that puts people and the planet at the forefront. 🚀 That’s why I founded P3PRMNT—a forward-thinking lifestyle brand designed to make a difference. ✨ Our mission is to inspire people to live more freely, make conscious purchasing decisions, and feel connected to something bigger than themselves. 🌱 We foster real-world connections through our \"IRL\" events. 🌿 And, on the B2B side, we help businesses across the UK streamline their transition to eco-friendly practices. And... we’re on a mission to take P3PRMNT global✌️ Want to know more or explore partnership opportunities? Send me a DM! 📧"
    },
    {
        "name": "Niall Cleaver",
        "JobTitle": "Entrepreneur documenting the journey of creating a timeless coffee cup brand | CEO & Founder of Cupsly",
        "location": "Royal Leamington Spa, England, United Kingdom",
        "about": "Hi, I’m Niall Cleaver, founder of Cupsly, a timeless reusable coffee cup brand launching in 2025.\n\nBut my story isn’t about a polished entrepreneur. My journey hasn’t been traditional. I left school without an English qualification, uncertain of what the future held. That failure shaped me, it forced me to think differently, fall into business, and ultimately embrace creativity, resilience, and the belief that change is possible, even when doubted.\n\nFast forward to today, and I’m the founder of Cupsly. The idea originated from my own frustration in my own life I couldn’t find a reusable coffee cup that matched my style. Everything felt cheap or uninspired, and I hated the idea of carrying something that didn’t reflect me. Cupsly is crafting a reusable coffee cup elevating it into a symbol of fashion.\n\nI can't wait for you to see it in 2025.\nHi, I’m Niall Cleaver, founder of Cupsly, a timeless reusable coffee cup brand launching in 2025. But my story isn’t about a polished entrepreneur. My journey hasn’t been traditional. I left school without an English qualification, uncertain of what the future held. That failure shaped me, it forced me to think differently, fall into business, and ultimately embrace creativity, resilience, and the belief that change is possible, even when doubted. Fast forward to today, and I’m the founder of Cupsly. The idea originated from my own frustration in my own life I couldn’t find a reusable coffee cup that matched my style. Everything felt cheap or uninspired, and I hated the idea of carrying something that didn’t reflect me. Cupsly is crafting a reusable coffee cup elevating it into a symbol of fashion. I can't wait for you to see it in 2025."
    }
]